INSERT INTO [hotel].[dbo].[employee] 
    ([full_name], [profile_picture], [address], [date_of_birth], [email], [gender], 
     [join_date], [password], [phone_number], [role], [status], [updated_at])
VALUES 
    
    ('王大明', '', '台北市中正區忠孝東路一段1號', '1985-07-12', 'staff1@hotel.com', '男', '2023-01-10', '123', '0912345678', 'STAFF', 'ACTIVE', '2023-05-20'),
    ('陳美玲', '', '高雄市左營區裕誠路200號', '1995-11-30', 'reservationist1@hotel.com', '女', '2023-07-01', '123', '0956789012', 'RESERVATIONIST', 'ACTIVE', '2023-08-25'),
    ('劉志明', '', '新北市板橋區文化路二段5號', '1992-02-14', 'merchandiser1@hotel.com', '男', '2022-06-25', '123', '0967890123', 'MERCHANDISER', 'LOAWP', '2023-09-05'),
    ('吳宗翰', '', '宜蘭市中山路五段77號', '1993-12-25', 'manager1@hotel.com', '男', '2021-12-30', '123', '0922234567', 'MANAGER', 'ACTIVE', '2024-02-05'),

    ('張偉傑', '', '台中市西屯區台灣大道三段100號', '1988-04-18', 'staff2@hotel.com', '男', '2023-03-20', '123', '0934567890', 'STAFF', 'RESIGNATION', '2023-07-10'),
    ('鄭雅雯', '', '台南市東區東寧路88號', '1994-08-07', 'reservationist2@hotel.com', '女', '2023-09-15', '123', '0989012345', 'RESERVATIONIST', 'LEAVE', '2023-11-20'),
    ('趙士傑', '', '基隆市仁愛區愛三路66號', '1989-03-03', 'merchandiser2@hotel.com', '男', '2022-04-10', '123', '0990123456', 'MERCHANDISER', 'ACTIVE', '2023-12-01'),
    ('王建宏', '', '新竹市東區光復路二段150號', '1990-10-10', 'manager2@hotel.com', '男', '2023-07-14', '123', '0943345678', 'MANAGER', 'ACTIVE', '2025-01-20'),

    ('黃建宏', '', '桃園市中壢區中山路50號', '1987-05-22', 'staff3@hotel.com', '男', '2021-10-10', '123', '0978901234', 'STAFF', 'ACTIVE', '2023-10-12'),
    ('李小華', '', '台北市信義區信義路五段20號', '1990-09-23', 'reservationist3@hotel.com', '女', '2022-12-15', '123', '0923456789', 'RESERVATIONIST', 'ACTIVE', '2023-06-15'),
    ('周心怡', '', '新竹市北區食品路12號', '1991-06-19', 'merchandiser3@hotel.com', '女', '2023-05-05', '123', '0911123456', 'MERCHANDISER', 'ACTIVE', '2024-01-10'),
    ('林志鵬', '', '台南市永康區中正路99號', '1983-04-21', 'manager3@hotel.com', '男', '2020-11-05', '123', '0944456789', 'MANAGER', 'ACTIVE', '2024-04-10');
